# -*- coding: utf-8 -*-
"""python.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1i0AQpvtsgdPS56WLx1r-_mkrYp7DU0Od

# Урок - 01.06.2023 - homework
"""

# Задача 1.1.

# Есть строка с перечислением песен

my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation';

# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.

# 1 вариант
# print(my_favorite_songs.split(",")[0].lstrip());
# print(my_favorite_songs.split(",")[-1].lstrip());
# print(my_favorite_songs.split(",")[1].lstrip());
# print(my_favorite_songs.split(",")[-2].lstrip());


# 2 вариант
print(my_favorite_songs[: 14]);
print(my_favorite_songs[-13:]);
print(my_favorite_songs[16: 30]);
print(my_favorite_songs[-26: -15]);

# Задача 1.2.

# Пункт A. + Пункт С. (с генерацией)
# Приведем плейлист песен в виде списка списков
# Список my_favorite_songs содержит список названий и длительности каждого трека
# Выведите общее время звучания трех случайных песен в формате
# Три песни звучат ХХХ минут

my_favorite_songs = [
    ['Waste a Moment', 3.03],
    ['New Salvation', 4.02],
    ['Staying\' Alive', 3.40],
    ['Out of Touch', 3.03],
    ['A Sorta Fairytale', 5.28],
    ['Easy', 4.15],
    ['Beautiful Day', 4.04],
    ['Nowhere to Run', 2.58],
    ['In This World', 4.02],
]

import random

random_songs = random.sample(my_favorite_songs, 3)
total_duration = sum(song[1] for song in random_songs)

minutes = int(total_duration)
seconds = int((total_duration - minutes) * 60)

print(f"Три песни звучат {minutes}:{seconds} минут")

# Задача 1.2.

# Пункт B. + Пункт С. (с генерацией)
# Есть словарь песен 
# Распечатайте общее время звучания трех случайных песен
# Вывод: Три песни звучат ХХХ минут.

my_favorite_songs_dict = {
    'Waste a Moment': 3.03,
    'New Salvation': 4.02,
    'Staying\' Alive': 3.40,
    'Out of Touch': 3.03,
    'A Sorta Fairytale': 5.28,
    'Easy': 4.15,
    'Beautiful Day': 4.04,
    'Nowhere to Run': 2.58,
    'In This World': 4.02,
}

import random
random_songs = random.sample(list(my_favorite_songs_dict.items()), 3)

total_duration = sum(song[1] for song in random_songs)
minutes = int(total_duration)
seconds = int((total_duration - minutes) * 60)

print(f"Три песни звучат {minutes}:{seconds} минут")

# Задача 1.2.

# Дополнительно 
# Пункт D.
# Переведите минуты и секунды в формат времени. Используйте модуль datetime

import datetime

def convert_to_time(minutes, seconds):
    total_seconds = minutes * 60 + seconds
    time = datetime.timedelta(seconds=total_seconds)
    time_format = datetime.datetime.strptime(str(time), "%H:%M:%S").strftime("%H:%M:%S")
    return time_format

minutes = 125
seconds = 37
time = convert_to_time(minutes, seconds)
print(time)

# Задача 1.3.

# Напишите скрипт, который принимает от пользователя номер месяца, 
# а возвращает количество дней в нем.
# Результат проверки вывести на консоль
# Допущение: в феврале 28 дней
# Если номер месяца некорректен - сообщить об этом

# Например,
    # Введите номер месяца: 3
    # Вы ввели март. 31 дней

    # Введите номер месяца: 2
    # Вы ввели февраль. 28 дней

    # Введите номер месяца: 15
    # Такого месяца нет!

month = [
    ['январь', 31],
    ['февраль', 28],
    ['март', 31],
    ['апрель', 30],
    ['май', 31],
    ['июнь', 30],
    ['июль', 31],
    ['август', 31],
    ['сентябрь', 30],
    ['октябрь', 31],
    ['ноябрь', 30],
    ['декабрь', 31],
]

number_month = int(input('Введите номер месяца '));
if 0 < number_month < len(month) + 1:
  check_month = month[number_month - 1];
  print('Вы ввели', check_month[0] + '.', check_month[1], 'дней');
else:
  print('Такого месяца нет!');

# Задача 1.4.

# Есть словарь кодов товаров titles

titles = {
    'Кроссовки тип 3 (Adidas)': '100000110',
    'Мячик тип 2 (Adidas)': '100000146',
    'Кепка тип 1 (Adidas)': '100000149',
    'Ремень тип 2 (Nike)': '100000194',
    'Футболка тип 1 (Adidas)': '100000224',
    'Шапка тип 5 (Puma)': '100000280',
}

# Товары находятся на складе и сохранены в виде словаря списков словарей,
# которые отражают количество товаров в магазине по каждому коду.

store = {
    '100000110': [{'quantity': 31, 'price': 1637}],
    '100000146': [ {'quantity': 4, 'price': 45}, {'quantity': 10, 'price': 48}],
    '100000149': [ {'quantity': 28, 'price': 279}, {'quantity': 32, 'price': 291}],
    '100000194': [{'quantity': 8, 'price': 220}, {'quantity': 1, 'price': 170}],
    '100000224': [{'quantity': 61, 'price': 438}, {'quantity': 23, 'price': 302},  {'quantity': 50, 'price': 412}],
    '100000280': [{'quantity': 26, 'price': 175}, ]
}

# Рассчитайте на какую сумму лежит каждого товара на складе.
#
# Вывести суммарную стоимость каждого товара в магазине в формате:
# "<товар> - <кол-во> шт, стоимость <общая стоимость> руб"

# Пример: "Кроссовки тип 3 (Adidas) - 31 шт, стоимость 50747 руб"


for code, details in store.items():
    title = [title for title, c in titles.items() if c == code][0]
    total_cost = sum(item['quantity'] * item['price'] for item in details)

    print(f"{title} - {sum(item['quantity'] for item in details)} шт, стоимость {total_cost} руб")

"""# Урок - 26.05.2023"""

print('Hello world');

x = 5;
y = 'Hello world';
x = 10;
z = 1.05;
arr = [1, 2, 3, 'I am here', 0.4];

print(type(x));
print(type(y));
print(type(z));
print(type(arr));
print(arr[3]);
print(len(arr));

x = 20
у = 0

try:
  a = x / у;
  print(a);
except ZeroDivisionError:
  print('Упсс, кажется вы пытаетесь поделить на 0 :(');

try:
  x = int(input('Что вы хотите поделить? '))
  y = int(input('На что вы хотите поделить? '))
  a = x / y
  print(a)
except ZeroDivisionError:
  print('Упсс, кажется вы пытаетесь поделить на 0 :(');
finally:
  print('You are pretty =)'); # выводится и для try и для except

import random
a = random.randint(30, 100);
print(a)

import random
arr = [1, 2, 3, 'I am here', 0.4];

a = random.choice(arr);
print(a)

l = random.random();
print(l); # от 0 до 1

# задача с игральным кубиком ( свой вариант )
import random
cube = [1, 2, 3, 4, 5, 6];

oneCube = random.choice(cube);
print(oneCube)
twoCube = random.choice(cube);
print(twoCube)
threeCube = random.choice(cube);
print(threeCube)
fourCube = random.choice(cube);
print(fourCube)

common = oneCube + twoCube + threeCube + fourCube;
print(common);

# задача с игральным кубиком ( решение учителя )

brocok1 = random.randint(1, 6);
brocok2 = random.randint(1, 6);
brocok3 = random.randint(1, 6);
brocok4 = random.randint(1, 6);

total = brocok1 + brocok2 + brocok3 + brocok4

print('Бросок №1: ',brocok1, 'Бросок №2: ',brocok2, 'Бросок №3: ',brocok3, 'Бросок №4: ',brocok4,);
print('Всего очков: ',total)

# задача с игральным кубиком ( решение учителя v2 )
import random

x = 4
y = []
total = 0

while x != 0:
  brocok = random.randint(1, 6);
  x -= 1;
  y.append(brocok);
  
print(y);
# total = sum(y); 

for i in y:
  total += i;

print("Всего очков: ", total);

# генератор паролей
import random;
chars = '+-/*!&$#?=@<>abcdefghijklnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890';
length = input('Какой длины нужен пароль? ');
password = '';

try:
  length = int(length);
  for i in range(length):
    password += random.choice(chars);

  print(password);
except ValueError:
  print('Упсс, вы ввели буквы. Прошу написать цифры =)');
  length = input('Попробуйте еще раз, какой длины нужен пароль? ');
  length = int(length);
  for i in range(length):
    password += random.choice(chars);

  print(password);

print(int(21) + float(21) * 0);